# CurveIsFilled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveIsFilled Property
ParameterTypeId Class See Also
---
"Filled"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveIsFilled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveIsFilled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveIsFilled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace